#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.ALR.module.client-roles.keycloak_role.ROLES["ALR_Admin_Data_Analyst"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "f0291800-c8c4-4977-816a-1c3aa04c6c6a"
        name       = "ALR_Admin_Data_Analyst"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ALR.module.client-roles.keycloak_role.ROLES["ALR_Admin_Data_Analyst"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "ee58139d-50af-4e47-b7b6-38e5a51b7072"
        name       = "ALR_Admin_Data_Analyst"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCIM_LRA.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "HCIM_LRA"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Healthcare Client Identity Management"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "HCIM_LRA"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCIM_LRA.keycloak_openid_hardcoded_claim_protocol_mapper.hcim_org will be created
  + resource "keycloak_openid_hardcoded_claim_protocol_mapper" "hcim_org" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "hcim_org"
      + claim_value         = "organization/LRA"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "hcim_org"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USAM.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "30add362-399f-4bbc-af36-b74638060d14"
        name                                       = "USAM"
      ~ valid_redirect_uris                        = [
          - "https://localhost/usam",
            # (2 unchanged elements hidden)
        ]
        # (23 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.HCIM_LRA.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*